linear_algebra/README.org
#+TITLE:  線形代数入門資料
#+AUTHOR:  Shigeto R. Nishitani
#+EMAIL:     (concat "nishitani@kwansei.ac.jp")
#+LANGUAGE:  jp
#+OPTIONS:   H:4 toc:t num:2

#+SETUPFILE: /Users/bob/Github/org-html-themes/setup/theme-readtheorg-local-daddygongon.setup
##+SETUPFILE: /Users/bob/Github/org-html-themes/setup/theme-readtheorg-local.setup
#+STARTUP:indent

* 演習レポート評価基準
*** 演習問題レポート作成時の注意点 
演習問題のレポートは，○が多いかどうかを評価しません．
ちゃんとやっているの確認，
記憶に定着する，後の学習を効率化するやり方をしているかどうかを評価します．
結果ではなく，途中経過の評価です．
その時の私の基準を紹介しておきます．

*** 評価の基準
後で見直したときに便利なように
- ○×をつけてるか?
- 丁寧に書かれているか?
- 計算の途中経過が記されているか?
- 間違ったところが赤ペンで修正されているか?
- 模範解答もしっかりと記入されているか?
見直しができなくても，書くだけで記憶に残ります.
*** そのほかの工夫
- 答えの確認だけでなく検算法
   - どうすれば答えが合っているか?
   - 試験中の見直しの手順
- 達成感を得るためにやった日や時間も記録しておく
   - どれだけコンスタントにできているか
   - どれだけ早くできるようになったか
   - 記憶に残すには，定期的におこなうことが必要
- 見直しの時間短縮のために自分の達成度評価を書く
   - ちょろい
   - すこし苦労したが自力で解けた
   - 計算間違いした
   - 自力で解けず，解答をちら見しながら解けた
   - 解答を見ても理解できなかった
これらをテキストに記しておくのも手です．
指定した演習書ではこのあたりの配慮がにくいです.
*** その他の誘導
- ボールペンで書いたのは+1点
- 5mm方眼レポート用紙で出したら+1点
*** 履歴
- <2011-04-02>
- <2013-04-10 17:07:29>
- <2018-04-25 水> revise赤ペン

* どんな資料にする?

2次元は紙にかけるので，3次元以上をpythonで． graph, 計算コマンドを表示．

- 応用例として，それぞれの重要なものがあればいいが．．．
- 例えば，直交についてのBreast
  cancerみたいに，わかりやすい例があるといい．
- Deep learningから取ってくる．．．
- 単語，特に英単語を覚えることの効用(inv, det)
-  線形計画？

逆行列の存在がone to oneだから．．．とか．ああ腹減った．

* 内容
1. [[./LA-I_lu.ipynb][lu分解]]
   1. 掃き出し
   2. 3次元でのグラフ解

2. [[./LA-II_det.ipynb][行列式]]
   1. 行列とベクトルの積
   2. 行列式
   3. 代数への応用があるが，あまり内容はない．

3. [[./LA-III_vector_space.ipynb][ベクトル空間]]
   1. 基底
   2. 線形従属，独立
   3. 直交補空間

4. [[./LA-IV_eig.ipynb][固有値]]
   1. 写像のgraph
   2. 固有値のgraph

5. [[./LA-V_map.ipynb][線形写像]]
   1. 像と核，null space
   2. 全射onto と単射one to one
