math_with_python_html/linear_algebra/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<title>線形代数入門資料</title>
<!-- 2018-05-11 金 11:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="/Users/bob/Github/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/Users/bob/Github/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/default.min.css"></head>
<body>
<div id="content">
<h1 class="title">線形代数入門資料</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 演習レポート評価基準</a>
<ul>
<li>
<ul>
<li><a href="#sec-1-0-1">演習問題レポート作成時の注意点</a></li>
<li><a href="#sec-1-0-2">評価の基準</a></li>
<li><a href="#sec-1-0-3">そのほかの工夫</a></li>
<li><a href="#sec-1-0-4">その他の誘導</a></li>
<li><a href="#sec-1-0-5">履歴</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. どんな資料にする?</a></li>
<li><a href="#sec-3">3. 内容</a></li>
</ul>
</div>
</div>
<p>
##+SETUPFILE: /Users/bob/Github/org-html-themes/setup/theme-readtheorg-local.setup
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 演習レポート評価基準</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-0-1" class="outline-4">
<h4 id="sec-1-0-1">演習問題レポート作成時の注意点</h4>
<div class="outline-text-4" id="text-1-0-1">
<p>
演習問題のレポートは，○が多いかどうかを評価しません．
ちゃんとやっているの確認，
記憶に定着する，後の学習を効率化するやり方をしているかどうかを評価します．
結果ではなく，途中経過の評価です．
その時の私の基準を紹介しておきます．
</p>
</div>
</div>

<div id="outline-container-sec-1-0-2" class="outline-4">
<h4 id="sec-1-0-2">評価の基準</h4>
<div class="outline-text-4" id="text-1-0-2">
<p>
後で見直したときに便利なように
</p>
<ul class="org-ul">
<li>○×をつけてるか?
</li>
<li>丁寧に書かれているか?
</li>
<li>計算の途中経過が記されているか?
</li>
<li>間違ったところが赤ペンで修正されているか?
</li>
<li>模範解答もしっかりと記入されているか?
</li>
</ul>
<p>
見直しができなくても，書くだけで記憶に残ります.
</p>
</div>
</div>
<div id="outline-container-sec-1-0-3" class="outline-4">
<h4 id="sec-1-0-3">そのほかの工夫</h4>
<div class="outline-text-4" id="text-1-0-3">
<ul class="org-ul">
<li>答えの確認だけでなく検算法
<ul class="org-ul">
<li>どうすれば答えが合っているか?
</li>
<li>試験中の見直しの手順
</li>
</ul>
</li>
<li>達成感を得るためにやった日や時間も記録しておく
<ul class="org-ul">
<li>どれだけコンスタントにできているか
</li>
<li>どれだけ早くできるようになったか
</li>
<li>記憶に残すには，定期的におこなうことが必要
</li>
</ul>
</li>
<li>見直しの時間短縮のために自分の達成度評価を書く
<ul class="org-ul">
<li>ちょろい
</li>
<li>すこし苦労したが自力で解けた
</li>
<li>計算間違いした
</li>
<li>自力で解けず，解答をちら見しながら解けた
</li>
<li>解答を見ても理解できなかった
</li>
</ul>
</li>
</ul>
<p>
これらをテキストに記しておくのも手です．
指定した演習書ではこのあたりの配慮がにくいです.
</p>
</div>
</div>
<div id="outline-container-sec-1-0-4" class="outline-4">
<h4 id="sec-1-0-4">その他の誘導</h4>
<div class="outline-text-4" id="text-1-0-4">
<ul class="org-ul">
<li>ボールペンで書いたのは+1点
</li>
<li>5mm方眼レポート用紙で出したら+1点
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-0-5" class="outline-4">
<h4 id="sec-1-0-5">履歴</h4>
<div class="outline-text-4" id="text-1-0-5">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2011-04-02&gt;</span></span>
</li>
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2013-04-10 17:07:29&gt;</span></span>
</li>
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2018-04-25 水&gt;</span></span> revise赤ペン
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> どんな資料にする?</h2>
<div class="outline-text-2" id="text-2">
<p>
2次元は紙にかけるので，3次元以上をpythonで． graph, 計算コマンドを表示．
</p>

<ul class="org-ul">
<li>応用例として，それぞれの重要なものがあればいいが．．．
</li>
<li>例えば，直交についてのBreast
cancerみたいに，わかりやすい例があるといい．
</li>
<li>Deep learningから取ってくる．．．
</li>
<li>単語，特に英単語を覚えることの効用(inv, det)
</li>
<li>線形計画？
</li>
</ul>

<p>
逆行列の存在がone to oneだから．．．とか．ああ腹減った．
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 内容</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="./LA-I_lu.ipynb">lu分解</a>
<ol class="org-ol">
<li>掃き出し
</li>
<li>3次元でのグラフ解
</li>
</ol>
</li>

<li><a href="./LA-II_det.ipynb">行列式</a>
<ol class="org-ol">
<li>行列とベクトルの積
</li>
<li>行列式
</li>
<li>代数への応用があるが，あまり内容はない．
</li>
</ol>
</li>

<li><a href="./LA-III_vector_space.ipynb">ベクトル空間</a>
<ol class="org-ol">
<li>基底
</li>
<li>線形従属，独立
</li>
<li>直交補空間
</li>
</ol>
</li>

<li><a href="./LA-IV_eig.ipynb">固有値</a>
<ol class="org-ol">
<li>写像のgraph
</li>
<li>固有値のgraph
</li>
</ol>
</li>

<li><a href="./LA-V_map.ipynb">線形写像</a>
<ol class="org-ol">
<li>像と核，null space
</li>
<li>全射onto と単射one to one
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2018-05-11 金 11:00</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
